# CODE 7-11

## MERGING

In [2]:
import pandas as pd 
df1 = pd.DataFrame([['a',90], ['b',80], ['c',40]], columns=['name', 'kor'])
df2 = pd.DataFrame([['a',75],['b',60], ['d', 90]], columns=['name', 'math'])
df1

  name  kor
0    a   90
1    b   80
2    c   40

In [4]:
df2

  name  math
0    a    75
1    b    60
2    d    90

In [6]:
df12 = df1.merge(df2, on = 'name') # inner
df12

  name  kor  math
0    a   90    75
1    b   80    60

In [8]:
df12 = df1.merge(df2, how = 'left', on = 'name')
df12

  name  kor  math
0    a   90  75.0
1    b   80  60.0
2    c   40   NaN

In [11]:
df12 = df1.merge(df2, how = 'right', on = 'name')
df12

  name   kor  math
0    a  90.0    75
1    b  80.0    60
2    d   NaN    90

In [12]:
df12 = df1.merge(df2, how = 'outer', on = 'name')
df12

  name   kor  math
0    a  90.0  75.0
1    b  80.0  60.0
2    c  40.0   NaN
3    d   NaN  90.0